app/Controllers/Common.php

    public function run_internal_cron()
    {
        if (!$this->request->isAJAX()) {
            // ...
            exit();
        }

        //delete old sessions
        $db = db_connect();
        $db->query("DELETE FROM ci_sessions WHERE timestamp < DATE_SUB(NOW(), INTERVAL 3 DAY)");
        //add last update
        $this->GeneralSettingModel->builder()->where('id', 1)->update(['last_cron_update' => date('Y-m-d H:i:s')]);
---
UPDATE `general_settings` SET `last_cron_update` = '2023-10-27 03:27:23'
WHERE `id` = 1

    private function getUsers($startDate, $endDate)
    {
        $this->userModel->builder('users')
            ->select('count(id) as users, DATE(created_at) as date')
            ->where('created_at <=', $endDate)
            ->where('created_at >=', $startDate)
            ->groupBy('date');


        $query =  $this->userModel->builder('users')->get();

        if (!empty($query->getResult())) {
---
SELECT count(id) as users, DATE(created_at) as date
FROM `users`
WHERE `created_at` <= '2023-10-27'
AND `created_at` >= '2023-10-01'
GROUP BY `date`

    private function getUsersAuth()
    {
        $this->userModel->builder('users')
            ->select('count(id) as users, user_type')
            ->groupBy('user_type');


        $query =  $this->userModel->builder('users')->get();

        if (!empty($query->getResult())) {
---
SELECT count(id) as users, `user_type`
FROM `users`
GROUP BY `user_type`