app/Models/ClientModel.php

SELECT *
FROM `client`
WHERE `client_id` = 'HFSdXiHssd'
---
    function list($client_id) {
        return $this->db->table("client")->select("*")->where(["client_id" => $client_id])->get()->getResultArray();

UPDATE `client` SET `client_id` = 'hfsdxihssd', `contact_display_name` = 'koko1', `pusher_app_id` = '1629807', `pusher_key` = '75f52badaf3ca79b84f4', `pusher_secret` = '10db69acd61370289a01', `pusher_cluster` = 'eu'
WHERE `client_id` = 'hfsdxihssd'
---
    function UpdateClient($client_id, $contact_display_name, $pusher_app_id, $pusher_key, $pusher_secret, $pusher_cluster) {
        $data = array(
            "client_id" => $client_id,
            "contact_display_name" => $contact_display_name,
            "pusher_app_id" => "1629807",
            "pusher_key" => "75f52badaf3ca79b84f4",
            "pusher_secret" => "10db69acd61370289a01",
            "pusher_cluster" => "eu",
        );
        return $this->db->table("client")->where(["client_id" => $client_id])->update($data);