app/Models/RolesPermissionsModel.php

    public function getAccessMenuCategory($role) {
        return $this->db->table('user_menu_category')
                        ->select('*,user_menu_category.id AS menuCategoryID, user_menu_category.position_order')
                        ->join('user_access', 'user_menu_category.id = user_access.menu_category_id')
                        ->orderBy('user_menu_category.position_order', 'ASC')
                        ->where(['user_access.role_id' => $role])
                        ->get()->getResultArray();
---
SELECT *, `user_menu_category`.`id` AS `menuCategoryID`, `user_menu_category`.`position_order`
FROM `user_menu_category`
JOIN `user_access` ON `user_menu_category`.`id` = `user_access`.`menu_category_id`
WHERE `user_access`.`role_id` = '2'
ORDER BY `user_menu_category`.`position_order` ASC

    public function checkUserMenuAccess($dataAccess) {
        return $this->db->table('user_access')
                        ->where([
                            'role_id' => $dataAccess['roleID'],
                            'menu_id' => $dataAccess['menuID']
                        ])
                        ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `user_access`
WHERE `role_id` = '2'
AND `menu_id` = '10'