app/Models/UsersModel.php

    public function getUser($username = false, $userID = false) {
        if ($username) {
            return $this->db->table('users')
                            ->select('*,users.id AS userID,user_role.id AS role_id')
                            ->join('user_role', 'users.role = user_role.id')
                            ->where(['username' => $username])
                            ->get()->getRow();
---
SELECT *, `users`.`id` AS `userID`, `user_role`.`id` AS `role_id`
FROM `users`
JOIN `user_role` ON `users`.`role` = `user_role`.`id`
WHERE `username` = 'tost'

    public function update_last_seen() {
        if (auth_check()) {
            //update last seen
            $data = array(
                'last_seen' => date("Y-m-d H:i:s"),
            );
            return $this->protect(false)->update(user()->id, $data);
---
UPDATE `users` SET `last_seen` = '2023-10-27 03:33:59', `updated_at` = '2023-10-27 03:33:59'
WHERE `users`.`id` IN ('8')